import numpy as np
st.set_page_config(page_title='🥔南宁美食地图🥔')
st.header("南宁美食地图")
restaurants = pd.DataFrame({
"餐厅": ["星艺会塔斯汀", "麦当劳(华成都市店)", "好友缘(西大店)", "小放肆烤肉(西南商都店)", "李嬢拌粉(金花茶公园店)"],
"类型": ["西餐", "西餐", "自助餐", "自助餐", "自助餐"],
"评分": [4.2, 4.5, 4.0, 4.7, 4.3],
"人均消费(元)": [20, 30, 80, 50, 15],
"位置X": [22.853973,22.843103,22.834317,22.814946,22.821271],
"位置Y": [108.222505,108.267250,108.284567,108.321104,108.357652]
})
df=pd.DataFrame(restaurants)
df.index.name='编号'
st.dataframe(df[0:5])
st.map(pd.DataFrame({
"latitude":[22.853973,22.843103,22.834317,22.814946,22.821271],
"longitude":[108.222505,108.267250,108.284567,108.321104,108.357652]}))
