
import streamlit as st
import pandas as pd

st.set_page_config(page_title='🍚南宁美食地图')

data=pd.DataFrame({
'时间':['9','10','11','12','13','14','15','16','17','18','19','20'],
'星艺荟塔斯汀':[50, 50, 80,20,45,60,20,44,32,11,47,32],
'麦当劳':[20, 60, 123,60,122,111,20,33,52,62,28,66],
'好友缘':[180, 150, 160,144,122,163,188,192,150,145,165,133],
'小放肆烤肉':[150,140,133,188,192,150,145,122,144,172,152,123],
'李嬢拌粉':[10,13,12,10,40,13,18,12,15,15,12,16]
})
df= pd.DataFrame(data)
index = pd.Series([1, 2, 3,4,5,6,7,8,9,10,11,12], name='序号')
df.index = index
st.write(df)
st.header("🕗用餐高峰时段")

df.set_index('时间', inplace=True)

st.area_chart(df,y=["星艺荟塔斯汀", "麦当劳",  "好友缘","小放肆烤肉", "李嬢拌粉"])
